Revit 2027 API
BuiltInFailures.RenderFailures.LightParametersNotInRange Property
 The value should be in range of [Value] and [Value].
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId LightParametersNotInRange { get; }
Public Shared ReadOnly Property LightParametersNotInRange As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ LightParametersNotInRange {
	FailureDefinitionId^ get ();
}
static member LightParametersNotInRange : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.RenderFailures Class
Autodesk.Revit.DB Namespace